## № 1 для максимальной строки
### Условие
Цепочка из символов латинского алфавита A, B, C, D, E, F. Найти длину самой длинной подцепочки, не содержащей символа D.
### Решение
```python
s = open('24.txt').readline()
m = 0 # Длина максимальной подходящей цепочки
for l in range(len(s)):
	for r in range(l+m, len(s)): # Перебираем цепочки длиной НЕ меньше максимальной найденной раньше
		c = s[l:r+1]
		if 'D' not in c: # Тут просто меняется условие
			m = max(m, len(c))
		else:
			break # Если внутри c есть 'D', то нет смысла смотреть другие строки с таким же началом
```
## № 2 для максимальной строки с all
### Условие
Цепочка из символов латинского алфавита. Найдите максимальную длину подстроки, в которой ни одна пара символов не записана два раза подряд. Например, не может быть ABAB
### Решение
```python
s = open('24.txt').readline()
m = 0 # Длина максимальной подходящей цепочки
for l in range(len(s)):
	for r in range(l+m, len(s)): # Перебираем цепочки длиной НЕ меньше максимальной найденной раньше
		c = s[l:r+1]
		if all(c[i]+c[i+1]!=c[i+2]+c[i+3] for i in range(len(c)-5)):
			m = max(m, len(c))
		else:
			break # Если внутри c есть 'D', то нет смысла смотреть другие строки с таким же началом
```
## № 2 для максимальной строки только из пар символов
### Условие
Цепочка из символов латинского алфавита. Определите максимальное количество идущих подряд пар символов ZX или ZY.
### Решение
```python
s = open('24.txt').readline()
m = 0 # Длина максимальной подходящей цепочки
for l in range(len(s)):
	for r in range(l+m, len(s)): # Перебираем цепочки длиной НЕ меньше максимальной найденной раньше
		c = s[l:r+1]
		if len(c)%2==0:
			if all(c[i]+c[i+1] in ['ZX', 'ZY'] for i in range(0, len(c), 2))
			else:
			break
print(m/2)
```
## № 3 для минимальной строки
### Условие
Цепочка из символов латинского алфавита. и точки. Определите минимальное количество идущих подряд символов, среди которых ровно семь точек.
### Решение
```python
s = open('24.txt').readline()

m=10000 # ставим максимум
for l in range(len(s)):
	for r in range(l, l+m): # Не ищим более минимальной длины
		c = s[l:r+1]
		if c.count('.')==7:
			m = min(m, len(c))
			break # Нет смысла искать более длинные строки
```
## № 3 для минимальной строки другая реализация
### Условие
Цепочка из символов латинского алфавита. и точки. Определите минимальную длину подстроки, в которой символ Z встречается не менее 120 раз
### Решение
```python
s = open('24.txt').readline()

m=10000 # ставим максимум
for l in range(len(s)):
	for r in range(l+m, l, -1): # Обратный перебор. От самой большой строки к самой маленькой
		c = s[l:r+1]
		if c.count('Z')>=120: 
			m = min(m, len(c))
		else:
			break
```
