```markdown
### Кодирование информации и расчет объема данных

---

#### Формулы для кодирования информации

1. **Количество значений и бит:**  
   $$
   N = 2^n, \quad \text{где } N \text{ — количество значений, } n \text{ — количество бит.}
   $$

2. **Расчет минимального количества бит для представления $N$ значений:**  
   $$
   n = \lceil \log_2(N) \rceil, \quad \text{где } \lceil x \rceil \text{ — округление вверх.}
   $$

3. **Перевод битов в байты:**  
   - 8 бит = 1 байт.  
   - 1024 байта = 1 килобайт (КБ).  
   - 1024 килобайта = 1 мегабайт (МБ).  

---

### Примеры решения задач

#### Пример 1: Определение количества бит для алфавита

**Условие:**  
Дан алфавит, состоящий из десятичных символов (10 штук) и дополнительных 1010 символов. Необходимо определить минимальное количество бит для представления всех символов.

**Решение:**  
1. Общее количество значений:  
   $$
   N = 10 + 1010 = 1020.
   $$  
2. Минимальное количество бит:  
   $$
   n = \lceil \log_2(1020) \rceil = 10 \quad (\text{так как } 2^{10} = 1024 > 1020).
   $$  

---

#### Пример 2: Размер пароля в байтах

**Условие:**  
Пароль состоит из 15 символов. Каждый символ кодируется минимально возможным числом бит. Определите размер одного пароля в байтах.

**Решение:**  
1. Количество бит на один символ:  
   $$
   \text{char\_bits} = \lceil \log_2(kod) \rceil,
   $$  
   где $kod$ — количество символов в кодировке.  
2. Общий размер пароля в битах:  
   $$
   \text{total\_bits} = 15 \cdot \text{char\_bits}.
   $$  
3. Перевод битов в байты с округлением вверх:  
   $$
   \text{size\_bytes} = \lceil \text{total\_bits} / 8 \rceil.
   $$  

**Пример реализации на Python:**  
```python
from math import ceil, log2

# Входные данные
kod = 9  # Количество символов в кодировке
num_chars = 15  # Длина пароля в символах

# Расчеты
char_bits = ceil(log2(kod))  # Бит на один символ
total_bits = num_chars * char_bits  # Общий размер в битах
size_bytes = ceil(total_bits / 8)  # Размер в байтах

# Размер 25 паролей
passwords_size = 25 * size_bytes
print(passwords_size)
```

---

#### Пример 3: Ограничение памяти для пользователей

**Условие:**  
Необходимо определить максимальное количество пользователей $k$, для которых общая память не превышает 2 КБайт. Для каждого пользователя выделяется место под пароль и дополнительную информацию.

**Решение:**  
1. Количество символов в кодировке:  
   $$
   kod = 26 + 26 = 52.
   $$  
2. Количество бит на один символ:  
   $$
   \text{chat\_bits} = \lceil \log_2(kod) \rceil.
   $$  
3. Размер пароля в байтах:  
   $$
   \text{pas\_bytes} = \lceil 7 \cdot \text{chat\_bits} / 8 \rceil.
   $$  
4. Общий размер данных для одного пользователя:  
   $$
   \text{user\_size} = \text{pas\_bytes} + 12.
   $$  
5. Проверка условия:  
   $$
   k \cdot \text{user\_size} \leq 2 \cdot 1024.
   $$  

**Пример реализации на Python:**  
```python
from math import ceil, log2

# Перебор количества пользователей
for k in range(2, 1000):  # Максимум 1000 пользователей
    kod = 26 + 26  # Количество символов в кодировке
    chat_bits = ceil(log2(kod))  # Бит на один символ
    pas_bytes = ceil(7 * chat_bits / 8)  # Размер пароля в байтах
    user_size = pas_bytes + 12  # Размер данных для одного пользователя
    if k * user_size <= 2 * 1024:  # Проверка ограничения по памяти
        result = k

# Вывод результата
print(result)
```
